
Archived entries from file /Users/a/Documents/working-directory/udacity-courses/fullstack/project2/exceeds-specifications-materials/testing-out-tournaments.org


** debugging
   :PROPERTIES:
   :ARCHIVE_TIME: 2016-05-11 Wed 10:58
   :ARCHIVE_FILE: ~/Documents/working-directory/udacity-courses/fullstack/project2/exceeds-specifications-materials/testing-out-tournaments.org
   :ARCHIVE_CATEGORY: testing-out-tournaments
   :END:
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
SELECT * from "player_tables" where tournament_name = 'tennis';
 #+END_SRC

 #+RESULTS:
 | player_id | player_name | tournament_name | wins | losses | draws | points | omw |
 |-----------+-------------+-----------------+------+--------+-------+--------+-----|
 |         3 | c           | tennis          |    0 |      1 |     0 |      0 |   3 |
 |         7 | g           | tennis          |    0 |      1 |     0 |      0 |   3 |
 |         1 | a           | tennis          |    1 |      0 |     0 |      3 |   0 |
 |         5 | e           | tennis          |    1 |      0 |     0 |      3 |   0 |
 |         2 | b           | tennis          |    0 |      1 |     0 |      0 |   3 |
 |         6 | f           | tennis          |    0 |      1 |     0 |      0 |   3 |
 |         4 | d           | tennis          |    1 |      0 |     0 |      3 |   0 |
 |         8 | h           | tennis          |    1 |      0 |     0 |      3 |   0 |

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
new_playerStandings_alt("tourney_practice", "player_tables", "tennis")
 #+END_SRC

 #+RESULTS:
 : [(1, 'a', 'tennis', 1, 0, 0, 3, 0), (5, 'e', 'tennis', 1, 0, 0, 3, 0), (4, 'd', 'tennis', 1, 0, 0, 3, 0), (8, 'h', 'tennis', 1, 0, 0, 3, 0), (2, 'b', 'tennis', 0, 1, 0, 0, 3), (7, 'g', 'tennis', 0, 1, 0, 0, 3), (3, 'c', 'tennis', 0, 1, 0, 0, 3), (6, 'f', 'tennis', 0, 1, 0, 0, 3)]

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
naive_pairings("tennis")
 #+END_SRC

 #+RESULTS:
 : Traceback (most recent call last):
 :   File "<stdin>", line 1, in <module>
 :   File "<stdin>", line 5, in naive_pairings
 : ValueError: need more than 0 values to unpack

****** use playerStandings function to get current results
 #+BEGIN_SRC python :session *Python* :results output :tangle yes
#Return a table ordered first by points and then OMW (to break ties?)
def new_playerStandings_alt(dbname, table_name):
    from_statement = keyword_statement_string(table_name, """FROM""")
    query = ("SELECT * " + from_statement + "ORDER BY points DESC, omw DESC;")
    return new_dbExecuteRetrievalWrapper_allrows(dbname, query)

def playerTables():
    new_playerStandings_alt("tourney_practice", "player_tables")
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
new_playerStandings_alt("tourney_practice", "player_tables")
 #+END_SRC

 #+RESULTS:
 : [(1, 'a', 1, 0, 0, 3, 0), (5, 'e', 1, 0, 0, 3, 0), (4, 'd', 1, 0, 0, 3, 0), (8, 'h', 1, 0, 0, 3, 0), (2, 'b', 0, 1, 0, 0, 3), (7, 'g', 0, 1, 0, 0, 3), (3, 'c', 0, 1, 0, 0, 3), (6, 'f', 0, 1, 0, 0, 3)]


 : [(1, 'a', 0, 0, 0, 0, 0), (2, 'b', 0, 0, 0, 0, 0), (3, 'c', 0, 0, 0, 0, 0), (4, 'd', 0, 0, 0, 0, 0), (5, 'e', 0, 0, 0, 0, 0), (6, 'f', 0, 0, 0, 0, 0), (7, 'g', 0, 0, 0, 0, 0), (8, 'h', 0, 0, 0, 0, 0)]


 : [(8, 'h', 1, 0, 0, 3, 0), (3, 'c', 1, 0, 0, 3, 0), (5, 'e', 1, 0, 0, 3, 0), (1, 'a', 0, 0, 1, 1, 1), (2, 'b', 0, 0, 1, 1, 1), (6, 'f', 0, 1, 0, 0, 3), (4, 'd', 0, 1, 0, 0, 3), (7, 'g', 0, 1, 0, 0, 3)]

******* explore list comprehension
 #+BEGIN_SRC python :session *Python* :results output :tangle yes
[len(row) for row in tables]
 #+END_SRC

 #+RESULTS:
 : [7, 7, 7, 7, 7, 7, 7, 7]


 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
for row in tables:
    print row
 #+END_SRC

 #+RESULTS:
 : 
 : ... (8, 'h', 1, 0, 0, 3, 0)
 : (3, 'c', 1, 0, 0, 3, 0)
 : (5, 'e', 1, 0, 0, 3, 0)
 : (1, 'a', 0, 0, 1, 1, 1)
 : (2, 'b', 0, 0, 1, 1, 1)
 : (6, 'f', 0, 1, 0, 0, 3)
 : (4, 'd', 0, 1, 0, 0, 3)
 : (7, 'g', 0, 1, 0, 0, 3)

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
for row in tables:
    print row[0], row[5]
 #+END_SRC

 #+RESULTS:
 : 
 : ... 8 3
 : 3 3
 : 5 3
 : 1 1
 : 2 1
 : 6 0
 : 4 0
 : 7 0

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
players_list = [id1, id2, id3, id4, id5, id6, id7, id8] = [row[0] for row in tables]
points_list = [pid1, pid2, pid3, pid4, pid5, pid6, pid7, pid8] = [row[5] for row in tables]

 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
[id1, pid1]
 #+END_SRC

 #+RESULTS:
 : [8, 3]

***** define new function to return pairings
 #+BEGIN_SRC python :session *Python* :results output :tangle yes
def naive_pairings():
    pairings = []
    tables = new_playerStandings_alt("tourney_practice", "player_recordz")
    [id1, id2, id3, id4, id5, id6, id7, id8] = [row[0] for row in tables]
    pairings = [(id1, id2), (id3, id4), (id5, id6), (id7, id8)]
    return pairings
 #+END_SRC

 #+RESULTS:

 #+BEGIN_SRC python :session *Python* :results output :tangle yes
naive_pairings()
 #+END_SRC

 #+RESULTS:
 : [(1, 5), (4, 8), (2, 7), (3, 6)]



*** match view
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from tournament_matches;
 #+END_SRC

 #+RESULTS:
 | match_id | tournament_name | round | home | away | home_score | away_score |
 |----------+-----------------+-------+------+------+------------+------------|
 |        1 | tennis          |     1 |    1 |    2 |          1 |          0 |
 |        2 | tennis          |     1 |    3 |    4 |          0 |          1 |
 |        3 | tennis          |     1 |    5 |    6 |          1 |          0 |
 |        4 | tennis          |     1 |    7 |    8 |          0 |          1 |
 |        5 | tennis          |     2 |    1 |    5 |          1 |          0 |
 |        6 | tennis          |     2 |    4 |    8 |          0 |          1 |
 |        7 | tennis          |     2 |    2 |    7 |          1 |          0 |
 |        8 | tennis          |     2 |    3 |    6 |          0 |          1 |
 |        9 | tennis          |     3 |    1 |    8 |          1 |          0 |
 |       10 | tennis          |     3 |    5 |    4 |          0 |          1 |
 |       11 | tennis          |     3 |    2 |    6 |          1 |          0 |
 |       12 | tennis          |     3 |    7 |    3 |          0 |          1 |
 |       13 | soccer          |     1 |    9 |   10 |          1 |          0 |
 |       14 | soccer          |     1 |   11 |   12 |          0 |          1 |
 |       15 | soccer          |     1 |   13 |   14 |          1 |          0 |
 |       16 | soccer          |     1 |   15 |   16 |          0 |          1 |
*** player views
 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from player_recordz 
ORDER BY points DESC, omw DESC ;
 #+END_SRC

 #+RESULTS:
 | player_id | wins | losses | draws | points | omw |
 |-----------+------+--------+-------+--------+-----|
 |         1 |    3 |      0 |     0 |      9 |  15 |
 |         8 |    2 |      1 |     0 |      6 |  15 |
 |         2 |    2 |      1 |     0 |      6 |  12 |
 |         4 |    2 |      1 |     0 |      6 |  12 |
 |         5 |    1 |      2 |     0 |      3 |  18 |
 |         6 |    1 |      2 |     0 |      3 |  12 |
 |         3 |    1 |      2 |     0 |      3 |   9 |
 |        12 |    1 |      0 |     0 |      3 |   0 |
 |        13 |    1 |      0 |     0 |      3 |   0 |
 |         9 |    1 |      0 |     0 |      3 |   0 |
 |        16 |    1 |      0 |     0 |      3 |   0 |
 |         7 |    0 |      3 |     0 |      0 |  15 |
 |        11 |    0 |      1 |     0 |      0 |   3 |
 |        14 |    0 |      1 |     0 |      0 |   3 |
 |        10 |    0 |      1 |     0 |      0 |   3 |
 |        15 |    0 |      1 |     0 |      0 |   3 |

 #+BEGIN_SRC sql :engine postgresql :database tourney_practice
select * from player_tables
ORDER BY points DESC, omw DESC ;
 #+END_SRC

 #+RESULTS:
 | player_id | player_name | wins | losses | draws | points | omw |
 |-----------+-------------+------+--------+-------+--------+-----|
 |         1 | a           |    3 |      0 |     0 |      9 |  15 |
 |         8 | h           |    2 |      1 |     0 |      6 |  15 |
 |         4 | d           |    2 |      1 |     0 |      6 |  12 |
 |         2 | b           |    2 |      1 |     0 |      6 |  12 |
 |         5 | e           |    1 |      2 |     0 |      3 |  18 |
 |         6 | f           |    1 |      2 |     0 |      3 |  12 |
 |         3 | c           |    1 |      2 |     0 |      3 |   9 |
 |        16 | harold      |    1 |      0 |     0 |      3 |   0 |
 |         9 | allen       |    1 |      0 |     0 |      3 |   0 |
 |        12 | devon       |    1 |      0 |     0 |      3 |   0 |
 |        13 | eldridge    |    1 |      0 |     0 |      3 |   0 |
 |         7 | g           |    0 |      3 |     0 |      0 |  15 |
 |        15 | g-money     |    0 |      1 |     0 |      0 |   3 |
 |        14 | fatool      |    0 |      1 |     0 |      0 |   3 |
 |        10 | beverly     |    0 |      1 |     0 |      0 |   3 |
 |        11 | cleanth     |    0 |      1 |     0 |      0 |   3 |

